{"intents": [
    {"tag": "noanswer",
     "patterns": [""],
     "responses": ["Maaf, saya tidak mengerti apa yang kamu maksud.", 
        "Maaf, untuk saat ini chatbot ini belum dapat menjawab pertanyaan kamu."],
     "context": [""]
    },
    {"tag": "greeting_sore",
        "patterns": ["selamat sore"],
        "responses": ["Selamat Sore"],
        "context": [""]
    },
    {"tag": "greeting_malam",
        "patterns": ["selamat malam", "selamat malem"],
        "responses": ["Selamat Malam"],
        "context": [""]
    },
    {
        "tag": "greeting1",
        "patterns": ["halo"],
        "responses": ["Halo, selamat datang! Apakah ada yang bisa saya bantu terkait kesehatan wanita?"],
        "context": [""]
    },
    {
        "tag": "greeting2",
        "patterns": ["hello"],
        "responses": ["Hello, selamat datang! Apakah ada yang bisa saya bantu terkait kesehatan wanita?"],
        "context": [""]
    },
    {
        "tag": "greeting3",
        "patterns": ["hai"],
        "responses": ["Hai, selamat datang! Apakah ada yang bisa saya bantu terkait kesehatan wanita?"],
        "context": [""]
    },
    {
        "tag": "pengalaman1",
        "patterns": ["selesai"],
        "responses": ["Selesai. Apakah ada yang ingin ditanyakan terkait kesehatan wanita?"],
        "context": [""]
    },
    {
        "tag": "pengalaman2",
        "patterns": ["Masalah"],
        "responses": ["Apakah ada yang ingin Anda diskusikan terkait kesehatan wanita?"],
        "context": [""]
    },
    {
        "tag": "pengalaman3",
        "patterns": ["Permasalahan"],
        "responses": ["Ada yang bisa saya bantu terkait permasalahan kesehatan wanita?"],
        "context": [""]
    },
    {
        "tag": "penutup1",
        "patterns": ["terima kasih"],
        "responses": ["Terima kasih telah menghubungi kami. Semoga sehat selalu!"],
        "context": [""]
    },
    {
        "tag": "fertility1",
        "patterns": ["Fertilisasi In Vitro"],
        "responses": ["Fertilisasi In Vitro (FIV) adalah salah satu teknik reproduksi buatan. Apakah Anda ingin mengetahui lebih lanjut tentang prosedur ini?"],
        "context": [""]
    },
    {
        "tag": "fertility2",
        "patterns": ["Kesuburan"],
        "responses": ["Kesuburan wanita dapat dipengaruhi oleh banyak faktor, termasuk usia, gaya hidup, dan kondisi kesehatan. Ada yang bisa saya bantu tentang masalah kesuburan?"],
        "context": [""]
    },
    {
        "tag": "fertility3",
        "patterns": ["Menstruasi Tidak Teratur"],
        "responses": ["Menstruasi tidak teratur bisa menjadi tanda masalah kesehatan wanita. Apakah Anda ingin mengetahui penyebab dan penanganannya?"],
        "context": [""]
    },
    {
        "tag": "pregnancy1",
        "patterns": ["Tanda Awal Kehamilan"],
        "responses": ["Tanda awal kehamilan dapat berbeda untuk setiap wanita, tetapi umumnya termasuk mual, muntah, dan peningkatan sensitivitas payudara. Apakah Anda ingin mengetahui lebih lanjut?"],
        "context": [""]
    },
    {
        "tag": "pregnancy2",
        "patterns": ["Perawatan Selama Kehamilan"],
        "responses": ["Perawatan selama kehamilan sangat penting untuk kesehatan ibu dan bayi. Apakah Anda ingin mengetahui lebih lanjut tentang perawatan prenatal?"],
        "context": [""]
    },
    {
        "tag": "pregnancy3",
        "patterns": ["Tes Kehamilan"],
        "responses": ["Tes kehamilan dapat dilakukan menggunakan tes urin atau tes darah. Apakah Anda ingin mengetahui lebih lanjut tentang cara kerjanya?"],
        "context": [""]
    },
    {
        "tag": "menopause1",
        "patterns": ["Gejala Menopause"],
        "responses": ["Gejala menopause termasuk hot flashes, insomnia, dan perubahan mood. Apakah Anda ingin mengetahui cara mengelola gejala ini?"],
        "context": [""]
    },
    {
        "tag": "menopause2",
        "patterns": ["Umur Menopause"],
        "responses": ["Umur menopause bisa bervariasi, tetapi umumnya terjadi antara usia 45-55 tahun. Apakah Anda ingin mengetahui lebih lanjut tentang faktor yang mempengaruhinya?"],
        "context": [""]
    },
    {
        "tag": "menopause3",
        "patterns": ["Pengobatan Menopause"],
        "responses": ["Ada berbagai pilihan pengobatan untuk mengelola gejala menopause, termasuk terapi hormon dan obat-obatan non-hormonal. Apakah Anda ingin mengetahui lebih lanjut?"],
        "context": [""]
    },
    {
        "tag": "breast_cancer1",
        "patterns": ["Deteksi Dini Kanker Payudara"],
        "responses": ["Deteksi dini kanker payudara sangat penting. Apakah Anda ingin mengetahui lebih lanjut tentang metode deteksi dini seperti mamografi dan pemeriksaan payudara sendiri?"],
        "context": [""]
    },
    {
        "tag": "breast_cancer2",
        "patterns": ["Faktor Risiko Kanker Payudara"],
        "responses": ["Ada banyak faktor risiko yang dapat meningkatkan kemungkinan seseorang mengembangkan kanker payudara, termasuk faktor genetik dan gaya hidup. Apakah Anda ingin mengetahui lebih lanjut?"],
        "context": [""]
    },
    {
        "tag": "breast_cancer3",
        "patterns": ["Pengobatan Kanker Payudara"],
        "responses": ["Pilihan pengobatan untuk kanker payudara dapat mencakup operasi, kemoterapi, radioterapi, terapi hormon, dan terapi target. Setiap kasus dapat memerlukan pendekatan yang berbeda tergantung pada stadium dan karakteristik individu. Apakah Anda ingin mengetahui lebih lanjut?"],
        "context": [""]
    },
    {
        "tag": "menstruasi1",
        "patterns": ["Menstruasi terlambat"],
        "responses": ["Menstruasi terlambat bisa disebabkan oleh berbagai faktor, termasuk stres, perubahan hormon, atau kehamilan. Apakah Anda ingin mengetahui lebih lanjut?"],
        "context": [""]
    },
    {
        "tag": "polip1",
        "patterns": ["Polip Rahim"],
        "responses": ["Polip rahim adalah pertumbuhan jinak di dalam rahim yang bisa menyebabkan pendarahan abnormal. Apakah Anda ingin mengetahui lebih lanjut tentang gejala dan pengobatannya?"],
        "context": [""]
    },
    {
        "tag": "infeksi1",
        "patterns": ["Infeksi Saluran Kencing"],
        "responses": ["Infeksi saluran kemih (ISK) umum terjadi pada wanita dan bisa menyebabkan gejala seperti nyeri saat buang air kecil dan sering buang air kecil. Apakah Anda ingin mengetahui lebih lanjut tentang penyebab dan pengobatannya?"],
        "context": [""]
    },
    {
        "tag": "endometriosis1",
        "patterns": ["Endometriosis"],
        "responses": ["Endometriosis adalah kondisi di mana jaringan yang biasanya tumbuh di dalam rahim mulai tumbuh di luar rahim, menyebabkan nyeri dan gangguan reproduksi. Apakah Anda ingin mengetahui lebih lanjut?"],
        "context": [""]
    },
    {
        "tag": "kb1",
        "patterns": ["Metode Kontrasepsi"],
        "responses": ["Ada banyak metode kontrasepsi yang tersedia, termasuk pil KB, IUD, suntik, dan kondom. Apakah Anda ingin mengetahui lebih lanjut tentang opsi yang tersedia?"],
        "context": [""]
    },
    {
        "tag": "sts1",
        "patterns": ["Seks Tanpa Penyakit"],
        "responses": ["Penting untuk berpraktik seks yang aman untuk mencegah penularan penyakit menular seksual (PMS). Apakah Anda ingin mengetahui lebih lanjut tentang cara melindungi diri dari PMS?"],
        "context": [""]
    },
    {
        "tag": "ovulasi1",
        "patterns": ["Periode Ovulasi"],
        "responses": ["Ovulasi terjadi ketika sel telur dilepaskan dari ovarium dan siap untuk dibuahi. Apakah Anda ingin mengetahui lebih lanjut tentang tanda-tanda ovulasi dan cara mengidentifikasinya?"],
        "context": [""]
    },
    {
        "tag": "fibroid1",
        "patterns": ["Mioma Uteri"],
        "responses": ["Mioma uteri adalah tumor jinak yang tumbuh di dinding rahim dan bisa menyebabkan gejala seperti nyeri dan pendarahan yang berat. Apakah Anda ingin mengetahui lebih lanjut tentang pengobatannya?"],
        "context": [""]
    },
    {
        "tag": "pcos1",
        "patterns": ["Sindrom Ovarium Polikistik"],
        "responses": ["Sindrom ovarium polikistik (PCOS) adalah kondisi hormonal yang umum pada wanita dan bisa menyebabkan masalah kesuburan dan gejala lainnya. Apakah Anda ingin mengetahui lebih lanjut?"],
        "context": [""]
    },
    {
        "tag": "vulvitis1",
        "patterns": ["Vulvitis"],
        "responses": ["Vulvitis adalah peradangan pada area vulva yang bisa disebabkan oleh infeksi atau iritasi. Apakah Anda ingin mengetahui lebih lanjut tentang gejala dan pengobatannya?"],
        "context": [""]
    },
    {
        "tag": "osteoporosis1",
        "patterns": ["Osteoporosis"],
        "responses": ["Osteoporosis adalah kondisi di mana tulang menjadi rapuh dan rentan patah tulang. Apakah Anda ingin mengetahui lebih lanjut tentang pencegahan dan pengobatannya?"],
        "context": [""]
    },
    {
        "tag": "kanker_serviks1",
        "patterns": ["Kanker Serviks"],
        "responses": ["Kanker serviks adalah jenis kanker yang paling umum pada wanita dan biasanya disebabkan oleh infeksi virus HPV. Apakah Anda ingin mengetahui lebih lanjut tentang pencegahan dan pengobatannya?"],
        "context": [""]
    },
    {
        "tag": "payudara_bengkak1",
        "patterns": ["Payudara Bengkak"],
        "responses": ["Payudara bengkak bisa menjadi tanda perubahan hormon, infeksi, atau kondisi medis lainnya. Apakah Anda ingin mengetahui lebih lanjut tentang penyebabnya?"],
        "context": [""]
    },
    {
        "tag": "perdarahan_postmenopause1",
        "patterns": ["Perdarahan Setelah Menopause"],
        "responses": ["Perdarahan setelah menopause bisa menjadi tanda masalah serius dan perlu dievaluasi oleh dokter. Apakah Anda ingin mengetahui lebih lanjut tentang penyebabnya?"],
        "context": [""]
    },
    {
        "tag": "tingkat_hormon1",
        "patterns": ["Tes Tingkat Hormon"],
        "responses": ["Tes tingkat hormon bisa membantu mengidentifikasi masalah kesehatan wanita seperti gangguan hormonal atau masalah kesuburan. Apakah Anda ingin mengetahui lebih lanjut tentang prosedur ini?"],
        "context": [""]
    },    
    {"tag": "penutup2",
        "patterns": ["terima kasih"],
        "responses": ["Kami akan mengabari Anda secepatnya"],
        "context": [""]
    }  
]
}